# Python을 배우는 이유
# 쉽고 간결한 문법: 읽기 쉽고 쓰기 쉬운 문법을 가지고 있어 쉽게 배우고 활용 할 수 있음
# 파이썬 커뮤니티의 지원: 세계적인 규모의 풍부한 온라인 포럼 및 커뮤니티 생태계
# 광범위한 응용 분야: 웹 개발, 데이터 분석, 인공지능, 머신러닝, 자동화 스크립트 등 다양한 분야에서 사용

# Python의 데이터 분석 활용
# 풍부한 라이브러리: pandas, numpy, matplotlib 등 데이터 분석에 최적화된 라이브러리 제공
# 데이터 처리 및 시각화: 대용량 데이터 처리와 시각화를 쉽게 할 수 있음
# 머신러닝 및 인공지능: scikit-learn, tensorflow, keras 등의 라이브러리를 통해 머신러닝과 딥러닝 모델을 구현할 수 있음

# 알고리즘 구현에 유리한 Python
# 직관적인 문법: 복잡한 논리 구조의 알고리즘을 이해하고 구현하기에 쉬움
# 강력한 표준 라이브러리: 다양한 알고리즘 구현에 필요한 도구를 제공
# 빠른 프로토타이핑: 알고리즘을 빠르게 테스트하고 수정할 수 있음

print('Hello, World')